export const uk = {
  uk: 'Українська',
  hello: 'Привіт!',
  home: 'Головна',
  login: 'Увійти',
  register: 'Реєструватися',
  link: 'посиланнм',
  form: {
    field: {
      name: 'Ім\'я та прізвище',
      email: 'Емейл',
      password: 'Пароль'
    },
    validation: {
      empty: 'Жодне з полів не може бути порожніми',
      length: 'Пароль повинен складатися з 8 символів',
      email: 'Такого користувача не існує',
      password: 'Невірна адреса електронної пошти або пароль',
      register: 'Користувач #email вже існує'
    },
    footer: {
      login: 'Якщо у тебе ще немає облікового запису, перейди на сторінку реєстрації за цим',
      register: 'Якщо у тебе вже є обліковий запис, перейди на сторінку входу за цим'
    }
  },
  user: {
    role: {
      admin: 'Адміністратор',
      user: 'Користувач',
      guest: 'Гість'
    },
    menu: {
      setting: 'Налаштування',
      logout: 'Вийти'
    }
  }
}